WARNING:tensorflow:`input_shape` is undefined or non-square, or `rows` is not in [128, 160, 192, 224]. Weights for input shape (224, 224) will be loaded as the default.
29it [00:00, 286.29it/s]Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         [(None, 56, 56)]          0         
_________________________________________________________________
lambda_1 (Lambda)            (None, 56, 56, 3)         0         
_________________________________________________________________
conv1 (Conv2D)               (None, 28, 28, 32)        864       
_________________________________________________________________
conv1_bn (BatchNormalization (None, 28, 28, 32)        128       
_________________________________________________________________
conv1_relu (ReLU)            (None, 28, 28, 32)        0         
_________________________________________________________________
conv_dw_1 (DepthwiseConv2D)  (None, 28, 28, 32)        288       
_________________________________________________________________
conv_dw_1_bn (BatchNormaliza (None, 28, 28, 32)        128       
_________________________________________________________________
conv_dw_1_relu (ReLU)        (None, 28, 28, 32)        0         
_________________________________________________________________
conv_pw_1 (Conv2D)           (None, 28, 28, 64)        2048      
_________________________________________________________________
conv_pw_1_bn (BatchNormaliza (None, 28, 28, 64)        256       
_________________________________________________________________
conv_pw_1_relu (ReLU)        (None, 28, 28, 64)        0         
_________________________________________________________________
conv_pad_2 (ZeroPadding2D)   (None, 29, 29, 64)        0         
_________________________________________________________________
conv_dw_2 (DepthwiseConv2D)  (None, 14, 14, 64)        576       
_________________________________________________________________
conv_dw_2_bn (BatchNormaliza (None, 14, 14, 64)        256       
_________________________________________________________________
conv_dw_2_relu (ReLU)        (None, 14, 14, 64)        0         
_________________________________________________________________
conv_pw_2 (Conv2D)           (None, 14, 14, 128)       8192      
_________________________________________________________________
conv_pw_2_bn (BatchNormaliza (None, 14, 14, 128)       512       
_________________________________________________________________
conv_pw_2_relu (ReLU)        (None, 14, 14, 128)       0         
_________________________________________________________________
conv_dw_3 (DepthwiseConv2D)  (None, 14, 14, 128)       1152      
_________________________________________________________________
conv_dw_3_bn (BatchNormaliza (None, 14, 14, 128)       512       
_________________________________________________________________
conv_dw_3_relu (ReLU)        (None, 14, 14, 128)       0         
_________________________________________________________________
conv_pw_3 (Conv2D)           (None, 14, 14, 128)       16384     
_________________________________________________________________
conv_pw_3_bn (BatchNormaliza (None, 14, 14, 128)       512       
_________________________________________________________________
conv_pw_3_relu (ReLU)        (None, 14, 14, 128)       0         
_________________________________________________________________
conv_pad_4 (ZeroPadding2D)   (None, 15, 15, 128)       0         
_________________________________________________________________
conv_dw_4 (DepthwiseConv2D)  (None, 7, 7, 128)         1152      
_________________________________________________________________
conv_dw_4_bn (BatchNormaliza (None, 7, 7, 128)         512       
_________________________________________________________________
conv_dw_4_relu (ReLU)        (None, 7, 7, 128)         0         
_________________________________________________________________
conv_pw_4 (Conv2D)           (None, 7, 7, 256)         32768     
_________________________________________________________________
conv_pw_4_bn (BatchNormaliza (None, 7, 7, 256)         1024      
_________________________________________________________________
conv_pw_4_relu (ReLU)        (None, 7, 7, 256)         0         
_________________________________________________________________
conv_dw_5 (DepthwiseConv2D)  (None, 7, 7, 256)         2304      
_________________________________________________________________
conv_dw_5_bn (BatchNormaliza (None, 7, 7, 256)         1024      
_________________________________________________________________
conv_dw_5_relu (ReLU)        (None, 7, 7, 256)         0         
_________________________________________________________________
conv_pw_5 (Conv2D)           (None, 7, 7, 256)         65536     
_________________________________________________________________
conv_pw_5_bn (BatchNormaliza (None, 7, 7, 256)         1024      
_________________________________________________________________
conv_pw_5_relu (ReLU)        (None, 7, 7, 256)         0         
_________________________________________________________________
conv_pad_6 (ZeroPadding2D)   (None, 8, 8, 256)         0         
_________________________________________________________________
conv_dw_6 (DepthwiseConv2D)  (None, 3, 3, 256)         2304      
_________________________________________________________________
conv_dw_6_bn (BatchNormaliza (None, 3, 3, 256)         1024      
_________________________________________________________________
conv_dw_6_relu (ReLU)        (None, 3, 3, 256)         0         
_________________________________________________________________
conv_pw_6 (Conv2D)           (None, 3, 3, 512)         131072    
_________________________________________________________________
conv_pw_6_bn (BatchNormaliza (None, 3, 3, 512)         2048      
_________________________________________________________________
conv_pw_6_relu (ReLU)        (None, 3, 3, 512)         0         
_________________________________________________________________
conv_dw_7 (DepthwiseConv2D)  (None, 3, 3, 512)         4608      
_________________________________________________________________
conv_dw_7_bn (BatchNormaliza (None, 3, 3, 512)         2048      
_________________________________________________________________
conv_dw_7_relu (ReLU)        (None, 3, 3, 512)         0         
_________________________________________________________________
conv_pw_7 (Conv2D)           (None, 3, 3, 512)         262144    
_________________________________________________________________
conv_pw_7_bn (BatchNormaliza (None, 3, 3, 512)         2048      
_________________________________________________________________
conv_pw_7_relu (ReLU)        (None, 3, 3, 512)         0         
_________________________________________________________________
conv_dw_8 (DepthwiseConv2D)  (None, 3, 3, 512)         4608      
_________________________________________________________________
conv_dw_8_bn (BatchNormaliza (None, 3, 3, 512)         2048      
_________________________________________________________________
conv_dw_8_relu (ReLU)        (None, 3, 3, 512)         0         
_________________________________________________________________
conv_pw_8 (Conv2D)           (None, 3, 3, 512)         262144    
_________________________________________________________________
conv_pw_8_bn (BatchNormaliza (None, 3, 3, 512)         2048      
_________________________________________________________________
conv_pw_8_relu (ReLU)        (None, 3, 3, 512)         0         
_________________________________________________________________
conv_dw_9 (DepthwiseConv2D)  (None, 3, 3, 512)         4608      
_________________________________________________________________
conv_dw_9_bn (BatchNormaliza (None, 3, 3, 512)         2048      
_________________________________________________________________
conv_dw_9_relu (ReLU)        (None, 3, 3, 512)         0         
_________________________________________________________________
conv_pw_9 (Conv2D)           (None, 3, 3, 512)         262144    
_________________________________________________________________
conv_pw_9_bn (BatchNormaliza (None, 3, 3, 512)         2048      
_________________________________________________________________
conv_pw_9_relu (ReLU)        (None, 3, 3, 512)         0         
_________________________________________________________________
conv_dw_10 (DepthwiseConv2D) (None, 3, 3, 512)         4608      
_________________________________________________________________
conv_dw_10_bn (BatchNormaliz (None, 3, 3, 512)         2048      
_________________________________________________________________
conv_dw_10_relu (ReLU)       (None, 3, 3, 512)         0         
_________________________________________________________________
conv_pw_10 (Conv2D)          (None, 3, 3, 512)         262144    
_________________________________________________________________
conv_pw_10_bn (BatchNormaliz (None, 3, 3, 512)         2048      
_________________________________________________________________
conv_pw_10_relu (ReLU)       (None, 3, 3, 512)         0         
_________________________________________________________________
conv_dw_11 (DepthwiseConv2D) (None, 3, 3, 512)         4608      
_________________________________________________________________
conv_dw_11_bn (BatchNormaliz (None, 3, 3, 512)         2048      
_________________________________________________________________
conv_dw_11_relu (ReLU)       (None, 3, 3, 512)         0         
_________________________________________________________________
conv_pw_11 (Conv2D)          (None, 3, 3, 512)         262144    
_________________________________________________________________
conv_pw_11_bn (BatchNormaliz (None, 3, 3, 512)         2048      
_________________________________________________________________
conv_pw_11_relu (ReLU)       (None, 3, 3, 512)         0         
_________________________________________________________________
conv_pad_12 (ZeroPadding2D)  (None, 4, 4, 512)         0         
_________________________________________________________________
conv_dw_12 (DepthwiseConv2D) (None, 1, 1, 512)         4608      
_________________________________________________________________
conv_dw_12_bn (BatchNormaliz (None, 1, 1, 512)         2048      
_________________________________________________________________
conv_dw_12_relu (ReLU)       (None, 1, 1, 512)         0         
_________________________________________________________________
conv_pw_12 (Conv2D)          (None, 1, 1, 1024)        524288    
_________________________________________________________________
conv_pw_12_bn (BatchNormaliz (None, 1, 1, 1024)        4096      
_________________________________________________________________
conv_pw_12_relu (ReLU)       (None, 1, 1, 1024)        0         
_________________________________________________________________
conv_dw_13 (DepthwiseConv2D) (None, 1, 1, 1024)        9216      
_________________________________________________________________
conv_dw_13_bn (BatchNormaliz (None, 1, 1, 1024)        4096      
_________________________________________________________________
conv_dw_13_relu (ReLU)       (None, 1, 1, 1024)        0         
_________________________________________________________________
conv_pw_13 (Conv2D)          (None, 1, 1, 1024)        1048576   
_________________________________________________________________
conv_pw_13_bn (BatchNormaliz (None, 1, 1, 1024)        4096      
_________________________________________________________________
conv_pw_13_relu (ReLU)       (None, 1, 1, 1024)        0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 1024)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 10)                10250     
=================================================================
Total params: 3,239,114
Trainable params: 3,217,226
Non-trainable params: 21,888
_________________________________________________________________
60000it [01:37, 616.36it/s]
10000it [00:15, 634.64it/s]
Epoch 1/50
600/600 [==============================] - 44s 68ms/step - loss: 0.8523 - accuracy: 0.7652 - val_loss: 0.7369 - val_accuracy: 0.7606
Epoch 2/50
600/600 [==============================] - 40s 66ms/step - loss: 0.2999 - accuracy: 0.8996 - val_loss: 0.3676 - val_accuracy: 0.8711
Epoch 3/50
600/600 [==============================] - 39s 65ms/step - loss: 0.2508 - accuracy: 0.9123 - val_loss: 0.2726 - val_accuracy: 0.9042
Epoch 4/50
600/600 [==============================] - 39s 65ms/step - loss: 0.2318 - accuracy: 0.9203 - val_loss: 0.3045 - val_accuracy: 0.8955
Epoch 5/50
600/600 [==============================] - 39s 65ms/step - loss: 0.2134 - accuracy: 0.9256 - val_loss: 0.3848 - val_accuracy: 0.8755
Epoch 6/50
600/600 [==============================] - 39s 65ms/step - loss: 0.2041 - accuracy: 0.9296 - val_loss: 0.2628 - val_accuracy: 0.9106
Epoch 7/50
600/600 [==============================] - 39s 65ms/step - loss: 0.1900 - accuracy: 0.9350 - val_loss: 0.3401 - val_accuracy: 0.8793
Epoch 8/50
600/600 [==============================] - 39s 65ms/step - loss: 0.2006 - accuracy: 0.9322 - val_loss: 0.3014 - val_accuracy: 0.8928
Epoch 9/50
600/600 [==============================] - 39s 65ms/step - loss: 0.1805 - accuracy: 0.9408 - val_loss: 0.2797 - val_accuracy: 0.9092
Epoch 10/50
600/600 [==============================] - 39s 65ms/step - loss: 0.1632 - accuracy: 0.9445 - val_loss: 0.2087 - val_accuracy: 0.9319
Epoch 11/50
600/600 [==============================] - 39s 65ms/step - loss: 0.1617 - accuracy: 0.9459 - val_loss: 0.2281 - val_accuracy: 0.9313
Epoch 12/50
600/600 [==============================] - 39s 65ms/step - loss: 0.1557 - accuracy: 0.9486 - val_loss: 0.2236 - val_accuracy: 0.9267
Epoch 13/50
600/600 [==============================] - 39s 65ms/step - loss: 0.1394 - accuracy: 0.9536 - val_loss: 0.2586 - val_accuracy: 0.9187
Epoch 14/50
600/600 [==============================] - 39s 65ms/step - loss: 0.1315 - accuracy: 0.9548 - val_loss: 0.2264 - val_accuracy: 0.9258
Epoch 15/50
600/600 [==============================] - 39s 65ms/step - loss: 0.1247 - accuracy: 0.9580 - val_loss: 0.2334 - val_accuracy: 0.9289
Epoch 16/50
600/600 [==============================] - 39s 65ms/step - loss: 0.1180 - accuracy: 0.9602 - val_loss: 0.2251 - val_accuracy: 0.9232
Epoch 17/50
600/600 [==============================] - 39s 65ms/step - loss: 0.1076 - accuracy: 0.9634 - val_loss: 0.2432 - val_accuracy: 0.9313
Epoch 18/50
600/600 [==============================] - 39s 65ms/step - loss: 0.1065 - accuracy: 0.9638 - val_loss: 0.2396 - val_accuracy: 0.9263
Epoch 19/50
600/600 [==============================] - 39s 65ms/step - loss: 0.1015 - accuracy: 0.9660 - val_loss: 0.2264 - val_accuracy: 0.9320
Epoch 20/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0927 - accuracy: 0.9688 - val_loss: 0.2572 - val_accuracy: 0.9346
Epoch 21/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0930 - accuracy: 0.9696 - val_loss: 0.2998 - val_accuracy: 0.9147
Epoch 22/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0854 - accuracy: 0.9721 - val_loss: 0.2468 - val_accuracy: 0.9331
Epoch 23/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0746 - accuracy: 0.9757 - val_loss: 0.2937 - val_accuracy: 0.9252
Epoch 24/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0792 - accuracy: 0.9738 - val_loss: 0.2363 - val_accuracy: 0.9346
Epoch 25/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0694 - accuracy: 0.9775 - val_loss: 0.2605 - val_accuracy: 0.9265
Epoch 26/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0614 - accuracy: 0.9794 - val_loss: 0.2929 - val_accuracy: 0.9297
Epoch 27/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0553 - accuracy: 0.9817 - val_loss: 0.2772 - val_accuracy: 0.9295
Epoch 28/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0551 - accuracy: 0.9817 - val_loss: 0.2466 - val_accuracy: 0.9405
Epoch 29/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0524 - accuracy: 0.9823 - val_loss: 0.2649 - val_accuracy: 0.9328
Epoch 30/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0522 - accuracy: 0.9829 - val_loss: 0.3623 - val_accuracy: 0.9261
Epoch 31/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0459 - accuracy: 0.9855 - val_loss: 0.2744 - val_accuracy: 0.9371
Epoch 32/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0450 - accuracy: 0.9856 - val_loss: 0.2799 - val_accuracy: 0.9315
Epoch 33/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0465 - accuracy: 0.9858 - val_loss: 0.2932 - val_accuracy: 0.9291
Epoch 34/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0476 - accuracy: 0.9839 - val_loss: 0.2850 - val_accuracy: 0.9398
Epoch 35/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0383 - accuracy: 0.9869 - val_loss: 0.2868 - val_accuracy: 0.9394
Epoch 36/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0405 - accuracy: 0.9869 - val_loss: 0.3738 - val_accuracy: 0.9287
Epoch 37/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0364 - accuracy: 0.9885 - val_loss: 0.2889 - val_accuracy: 0.9405
Epoch 38/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0298 - accuracy: 0.9903 - val_loss: 0.2955 - val_accuracy: 0.9343
Epoch 39/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0375 - accuracy: 0.9873 - val_loss: 0.3106 - val_accuracy: 0.9316
Epoch 40/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0295 - accuracy: 0.9902 - val_loss: 0.3855 - val_accuracy: 0.9329
Epoch 41/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0327 - accuracy: 0.9898 - val_loss: 0.3262 - val_accuracy: 0.9386
Epoch 42/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0282 - accuracy: 0.9907 - val_loss: 0.3134 - val_accuracy: 0.9380
Epoch 43/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0320 - accuracy: 0.9899 - val_loss: 0.2978 - val_accuracy: 0.9362
Epoch 44/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0255 - accuracy: 0.9914 - val_loss: 0.3030 - val_accuracy: 0.9374
Epoch 45/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0300 - accuracy: 0.9908 - val_loss: 0.3270 - val_accuracy: 0.9341
Epoch 46/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0280 - accuracy: 0.9910 - val_loss: 0.3336 - val_accuracy: 0.9363
Epoch 47/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0260 - accuracy: 0.9915 - val_loss: 0.3966 - val_accuracy: 0.9286
Epoch 48/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0283 - accuracy: 0.9901 - val_loss: 0.3524 - val_accuracy: 0.9300
Epoch 49/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0279 - accuracy: 0.9910 - val_loss: 0.2874 - val_accuracy: 0.9410
Epoch 50/50
600/600 [==============================] - 39s 65ms/step - loss: 0.0222 - accuracy: 0.9934 - val_loss: 0.3567 - val_accuracy: 0.9368
<tensorflow.python.keras.callbacks.History at 0x7f3f0048a950>

 Test accuracy: 0.9405999779701233

